Grooming/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиПолученияИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Питомцы</name>
    <attributes>
      <name>ВидПитомца</name>
      <type>
        <types>EnumRef.ВидыПитомцев</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаПитомца</name>
      <type>
        <types>CatalogRef.ПородыПитомцев</types>
      </type>
    </attributes>
    <attributes>
      <name>КличкаПитомца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияПитомца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Grooming/src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Клиент</name>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Договор.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ИсточникИнформации.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Питомцы.Видимость = Истина;

		Если Не Объект.Договор.Пустая() Тогда
			Объект.Договор = Неопределено;
		КонецЕсли;

		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";
	Иначе
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ИсточникИнформации.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.Договор.Видимость = Истина;

		Если ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
			Объект.ДатаРождения = '0001,01,01';
		КонецЕсли;
		Если Не Объект.ИсточникИнформации.Пустая() Тогда
			Объект.ИсточникИнформации = Неопределено;
		КонецЕсли;
		Если Не Объект.Пол.Пустая() Тогда
			Объект.Пол = Неопределено;
		КонецЕсли;
		Если Не Объект.Питомцы.Количество() <> 0 Тогда
			Объект.Питомцы.Очистить();
		КонецЕсли;

		Элементы.Наименование.Заголовок = "Наименование";

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
